---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.InvalidDataSet
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.InvalidDataSet

No data could be imported. Would typically be reported as a error. May be reported as a fatal error.